{"pe_description": "The Banks sub-sector in Indonesia exhibits a P/E ratio of 14.16, surpassing the average IDX P/E ratio. This year's P/E ratio outperforms last year's, ranking 24th among Indonesian sub-sectors. Within the sub-sector, 17 companies exceed the average P/E ratio. PT Bank Victoria International Tbk (###Bank Victoria International Tbk####), PT Bank Jabar Banten Tbk (###Bank Pembangunan Daerah Jawa Barat dan Banten Tbk####), and PT Bank Tabungan Negara (Persero) Tbk (###PT Bank Tabungan Negara (Persero) Tbk####) are undervalued based on P/E ratio, while PT Bank Arta Graha Internasional Tbk (###PT Bank Jago Tbk.####) is overvalued and should be avoided. Factors influencing growth in this sub-sector include interest rates, loan demand, and non-interest income.", "health_description": "The Banks sub-sector, comprising 47 companies, ranks 16th in terms of price changes over the past 30 days. Its average price changes underperform the IDX's average. No new listings occurred this month, with the last one dating back to 2021-06-30, indicating potential barriers to entry. Out of 47 companies, 15 experienced positive price changes in the last 30 days. Factors that can influence the Banks sub-sector's health index include interest rate policies set by Bank Indonesia, regulations imposed by the Financial Services Authority (OJK), and the overall economic climate.", "growth_description": "The Banks sub-sector in Indonesia has experienced a significant growth in the past year, with an average YoY quarter earnings change of 10.14% and an average YoY quarter revenue change of 12.59%. This growth has placed the Banks sub-sector at the 20th and 15th positions in terms of earnings and revenue rank, respectively, compared to other sub-sectors. Among the companies in the Banks sub-sector, ###Bank of India Indonesia Tbk####, ###PT Krom Bank Indonesia Tbk####, and ###PT Bank Panin Dubai Syariah Tbk.#### stand out as the companies with the highest YoY earning growth, YoY revenue growth, and net profit margin, respectively. However, it is important to note that the growth of the Banks sub-sector can be affected by various conditions, such as changes in interest rates, economic conditions, and regulatory changes."}