{"pe_description": "The Leisure Goods sub-sector in Indonesia exhibits a unique set of factors that influence its growth prospects. These factors include:\n\n- P/E ratio value of -9.33, indicating negative earnings compared to last year.\n- Overvalued P/E ratio compared to the average IDX P/E ratio.\n- ###PT Sepeda Bersama Indonesia Tbk#### is the most undervalued company based on P/E ratio, while ###PT Sepeda Bersama Indonesia Tbk#### is overvalued and should be avoided.\n- No companies outperform the Leisure Goods average P/E ratio value.", "health_description": "The Leisure Goods sub-sector, with only three companies, ranked 12th in terms of price changes over the past 30 days. It outperformed the IDX in terms of average price changes during that period. There were no new listings in the sub-sector this month, with the last one occurring in March 2022. This could indicate barriers to entry. However, none of the three companies experienced positive price changes in the last 30 days. Factors that could affect the sub-sector's health index include changes in consumer spending patterns, government regulations, and technological advancements. The Indonesian government body responsible for regulating the Leisure Goods sub-sector is the Ministry of Trade.", "growth_description": "The Leisure Goods sub-sector in Indonesia has experienced significant growth in the past year, with an average YoY quarter earnings change of 102.85% and an average YoY quarter revenue change of 118.0%. This growth has placed the sub-sector 6th in terms of earnings rank and 4th in terms of revenue rank compared to other sub-sectors. Within the Leisure Goods sub-sector, ###Inti Agri Resources Tbk####, ###PT Sepeda Bersama Indonesia Tbk####, and ###PT Sepeda Bersama Indonesia Tbk#### have demonstrated strong performance, with ###Inti Agri Resources Tbk#### having the highest YoY earning growth, ###PT Sepeda Bersama Indonesia Tbk#### having the highest YoY revenue growth, and ###PT Sepeda Bersama Indonesia Tbk#### having the highest net profit margin. However, the growth of the Leisure Goods sub-sector can be affected by various conditions, such as changes in consumer preferences, disposable income, and government regulations specifically related to the leisure goods industry in Indonesia."}