{"pe_description": "The Pharmaceuticals & Health Care Research sub-sector in Indonesia has a P/E ratio of 8.8, higher than the average IDX P/E ratio and outperforming its last year's P/E ratio. It ranks 16th among other sub-sectors in the Indonesian market. Within this sub-sector, ###PT Organon Pharma Indonesia Tbk####, ###Tempo Scan Pacific Tbk####, and ###Merck Tbk#### are the most undervalued companies based on their P/E ratios, while ###Kalbe Farma Tbk#### is overvalued and should be avoided. Factors influencing growth in this sub-sector include:\n\n- Government policies and regulations related to healthcare and pharmaceuticals\n- Technological advancements in healthcare and pharmaceuticals\n- Demographic changes and aging population\n- Increasing healthcare awareness and demand for quality healthcare services\n- Competition and market dynamics within the Pharmaceuticals & Health Care Research sub-sector", "health_description": "The Pharmaceuticals & Health Care Research sub-sector's performance is below average compared to the overall market, with only one company showing positive price changes in the last 30 days. This sub-sector's resilience and health index can be affected by factors specific to the healthcare industry, such as regulatory changes by the Indonesian Ministry of Health, new drug approvals, and advancements in medical technology. Therefore, investors in this sub-sector should closely monitor these factors to assess the potential impact on their investments.", "growth_description": "The Pharmaceuticals & Health Care Research sub-sector in Indonesia has experienced a decline in its growth over the past year, with an average YoY quarter earnings change of -55.2% and an average YoY quarter revenue change of -3.67%. This sub-sector ranks 28th in terms of earnings and 30th in terms of revenue compared to other sub-sectors. ###Darya-Varia Laboratoria Tbk####, ###PT Organon Pharma Indonesia Tbk####, and ###PT Industri Jamu Dan Farmasi Sido Muncul Tbk#### are the companies with the highest YoY earning growth, YoY revenue growth, and net profit margin, respectively, within this sub-sector. Conditions that can affect the growth of the Pharmaceuticals & Health Care Research sub-sector in Indonesia include changes in government regulations, such as pricing policies and reimbursement rates, as well as the introduction of new drugs and treatments."}